app/controllers/beers_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def set_breweries_and_styles_for_template
    @breweries = Brewery.all

INSERT INTO "beers" ("name", "style", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Koff"], ["style", "Weizen"], ["brewery_id", 1], ["created_at", "2017-02-11 11:21:25.670537"], ["updated_at", "2017-02-11 11:21:25.670537"]]
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save