app/controllers/beers_controller.rb

SELECT "breweries".* FROM "breweries"
---
  def set_breweries_and_styles_for_template
    @breweries = Brewery.all