app/controllers/ratings_controller.rb

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 11], ["beer_id", 1], ["created_at", "2017-02-09 14:08:19.484747"], ["updated_at", "2017-02-09 14:08:19.484747"]]
---
  def create
    @rating = Rating.new params.require(:rating).permit(:score, :beer_id)

    if current_user.nil?
      redirect_to signin_path, notice:'you should be signed in'
    elsif @rating.save